using System.ComponentModel.DataAnnotations;
using System.ComponentModel.DataAnnotations.Schema;
using System.Linq;
using System.Threading.Tasks;

namespace grad2021.Models
{
    //public enum BranchName
    //{الرياضيات_والفيزيقا_الهندسية, هندسة_القوى_والآلات_الكهربية, هندسة_الإلكترونيات_والاتصالات_الكهربية, هندسة_الحاسبات_والنظم, الهندسة_الميكانيكية, هندسة_الإنتاج_والتصميم_الميكانيكي, الهندسة_الصناعية, هندسة_القوى_الميكانيكية, الهندسة_المدنية, الهندسة_المعمارية}

    //public enum DepartmentName
    //{الرياضيات_والفيزيقا_الهندسية, الهندسة_الكهربية, الهندسة_الميكانيكية, الهندسة_المدنية, الهندسة_المعمارية}

    //public enum LevelName
    //{
    //    الإعدادية, الأولى, الثانية, الثالثة, الرابعة, إداري, معيد,
    //    [Display(Name = "مدرس مساعد")]
    //    مدرس_مساعد,
    //    [Display(Name = "أستاذ مساعد")]
    //    مدرس,
    //    أستاذ_مساعد,
    //    أستاذ,
    //    [Display(Name = "أستاذ متفرغ")]
    //    أستاذ_متفرغ
    //}

    //public enum DepartmentCodeValue
    //{ ريض, فيز, ميك, عام, هند, مدن, كھع, كهق, كهت, كهح, قوى, تمج, صنع, عمر }

    //public enum LevelBranchID
    //{
    //    إعدادي_هندسة_لائحة2017,
    //    أولى_هندسة_القوى_والآلات_الكهربية_لائحة2017,
    //    ثانية_هندسة_القوى_والآلات_الكهربية_لائحة2017,
    //    ثالثة_هندسة_القوى_والآلات_الكهربية_لائحة2017,
    //    رابعة_هندسة_القوى_والآلات_الكهربية_لائحة2017,
    //    أولى_هندسة_الإلكترونيات_والاتصالات_الكهربية_لائحة2017,
    //    ثانية_هندسة_الإلكترونيات_والاتصالات_الكهربية_لائحة2017,
    //    ثالثة_هندسة_الإلكترونيات_والاتصالات_الكهربية_لائحة2017,
    //    رابعة_هندسة_الإلكترونيات_والاتصالات_الكهربية_لائحة2017,
    //    أولى_هندسة_الحاسبات_والنظم_لائحة2017,
    //    ثانية_هندسة_الحاسبات_والنظم_لائحة2017,
    //    ثالثة_هندسة_الحاسبات_والنظم_لائحة2017,
    //    رابعة_هندسة_الحاسبات_والنظم_لائحة2017,
    //    أولى_الهندسة_الميكانيكية_لائحة2017,
    //    ثانية_الهندسة_الميكانيكية_لائحة2017,
    //    ثالثة_الهندسة_الميكانيكية_لائحة2017,
    //    رابعة_هندسة_الإنتاج_والتصميم_الميكانيكي_لائحة2017,
    //    رابعة_الهندسة_الصناعية_لائحة2017,
    //    رابعة_هندسة_القوى_الميكانيكية_لائحة2017,
    //    أولى_الهندسة_المدنية_لائحة2017,
    //    ثانية_الهندسة_المدنية_لائحة2017,
    //    ثالثة_الهندسة_المدنية_لائحة2017,
    //    رابعة_الهندسة_المدنية_لائحة2017,
    //    أولى_الهندسة_المعمارية_لائحة2017,
    //    ثانية_الهندسة_المعمارية_لائحة2017,
    //    ثالثة_الهندسة_المعمارية_لائحة2017,
    //    رابعة_الهندسة_المعمارية_لائحة2017
    //}
    public enum CourseGrade
    {
        امتياز, جيد_جدا, جيد, مقبول, ضعيف, راسب_لائحة
    }
    public enum StudentGrade
    {
        امتياز, جيد_جدا, جيد, مقبول, بمواد, راسب, مفصول
    }
    public enum StudentStatus
    {
        مستجد, باق
    }

    public enum Term
    { الأول, الثاني, نوفمبر }

    public enum ProfessionDegree
    {
        معيد,
        [Display(Name ="مدرس مساعد")]
        مدرس_مساعد,
        مدرس,
        [Display(Name = "أستاذ مساعد")]
        أستاذ_مساعد,
        أستاذ,
        [Display(Name = "أستاذ متفرغ")]
        أستاذ_متفرغ
    }

    public enum Gender
    { ذكر, أنثى }
    public enum SelectionStatus
    { إعدادي, أولى,رابعة_ميكانيكا}
}

//public enum Boys
//{
//    [Display(Name = "Good Boy")]
//    GoodBoy,
//    [Display(Name = "Bad Boy")]
//    BadBoy
//}